fabkury/p64/firmware/sdkconfig.defaults
# p64 firmware: ESP-IDF defaults for the Waveshare ESP32-S3-RGB-Matrix board.
# Only deviations from ESP-IDF's own defaults are listed. The generated sdkconfig is
# git-ignored; edit this file (a changed default only takes effect after deleting the
# generated sdkconfig or through menuconfig). Measured reasons for the panel and network
# values are in ../hardware-tests/README.md.

CONFIG_IDF_TARGET="esp32s3"

# --- Module: ESP32-S3-WROOM-2-N32R16V (32 MB octal flash, 16 MB octal PSRAM) ---
CONFIG_ESPTOOLPY_OCT_FLASH=y
CONFIG_ESPTOOLPY_FLASHMODE_OPI=y
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_DTR=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
# CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL is set at the end of this file (1024 since 2026-09-22).
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# --- Partition table: two 8 MB app slots, 64 KB NVS, 256 KB core dump, data ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# The app marks itself valid at boot; an image that never gets there rolls back.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# Updates may also come from a plain-HTTP URL on the LAN (a local build); the SHA256 the
# caller supplies is what protects that path.
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# --- Console: the board's USB port is the ESP32-S3's native USB Serial/JTAG ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- Crash handling: core dump to flash (ELF); task watchdog on the core-0 idle task only.
# Core 1 is the playback core: an artwork whose frames decode slower than their delays
# keeps the player task busy for as long as it plays (the no-drop rule slows playback
# instead of skipping), so the core-1 idle task legitimately starves. ---
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP_BROWNOUT_DET=y

# --- TLS: hardware AES and SHA; the panel's GDMA channel outranks them (HUB75_GDMA_PRIORITY) ---
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y

# --- Network throughput (measured in the hardware tests): 64 KB TCP window, lwIP in PSRAM,
# TLS buffers from the default allocator, released between records ---
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
# A 128x128 DDP frame is 35 datagrams in a burst; the default mailbox of 6 drops the rest.
CONFIG_LWIP_UDP_RECVMBOX_SIZE=48
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
# The parsed certificates, keys and CA of a session are freed once the handshake is
# done (they are re-parsed from the PEMs on the next handshake): the persistent MQTT
# session must leave room for a second, transient TLS session (ADR 0009).
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
# Wi-Fi: fewer static (internal, DMA) receive buffers; the dynamic ones live in PSRAM,
# and a stream frame of 128x128 is a burst of 36 datagrams that must all find one (24
# lost 4-5 % of them, 64 none; measured 2026-09-19).
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_RX_BA_WIN=4
CONFIG_LWIP_LOCAL_HOSTNAME="p64"
# Sockets: the HTTP server keeps up to 12 client sockets plus 3 of its own (a browser
# opens six at once and holds them), then mDNS, SNTP, MQTT, one download or update, two
# UDP stream listeners: about 22; lwIP's default 10 starved the server (page loads hung
# with requests pending, 2026-09-19).
CONFIG_LWIP_MAX_SOCKETS=24
CONFIG_HTTPD_WS_SUPPORT=y
# Time (ADR 0011): only NTP makes the time trusted. Four SNTP slots: the server the router
# offers over DHCP (option 42, slot 0), the setting, time.google.com, time.cloudflare.com;
# a re-sync every 6 h. net/clock.cpp checks these at compile time.
CONFIG_LWIP_SNTP_MAX_SERVERS=4
CONFIG_LWIP_DHCP_GET_NTP_SRV=y
CONFIG_LWIP_DHCP_MAX_NTP_SERVERS=1
CONFIG_LWIP_SNTP_UPDATE_DELAY=21600000

# --- CPU / RTOS / compiler ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# The system event task ran with 132 bytes of headroom and the TCP/IP task with 720
# (measured 2026-09-19); both get room.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3584
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096
# Task list with stack headroom for the diagnostics (spec 15.5).
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
# Tasks that never touch the flash cache may keep their stacks in PSRAM (internal RAM
# is the scarce resource on this board).
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
# The main task (state machine) runs on core 0 with the network; the render and player
# tasks are created on core 1 by the firmware itself (docs/architecture.md section 2).
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n

# --- HUB75 driver (vendored esphome/esp-hub75 + p64 patch): Waveshare ESP32-S3-RGB-Matrix pins ---
CONFIG_HUB75_BOARD_CUSTOM=y
CONFIG_HUB75_PIN_R1=4
CONFIG_HUB75_PIN_G1=5
CONFIG_HUB75_PIN_B1=6
CONFIG_HUB75_PIN_R2=7
CONFIG_HUB75_PIN_G2=15
CONFIG_HUB75_PIN_B2=16
CONFIG_HUB75_PIN_A=18
CONFIG_HUB75_PIN_B=8
CONFIG_HUB75_PIN_C=3
CONFIG_HUB75_PIN_D=42
CONFIG_HUB75_PIN_E=9
CONFIG_HUB75_PIN_LAT=40
CONFIG_HUB75_PIN_OE=2
CONFIG_HUB75_PIN_CLK=41

# --- HUB75 panel: Waveshare RGB-Matrix-P2-64x64 (1/32 scan, FM6126A-class driver IC) ---
CONFIG_HUB75_PANEL_WIDTH=64
CONFIG_HUB75_PANEL_HEIGHT=64
CONFIG_HUB75_WIRING_STANDARD=y
CONFIG_HUB75_DRIVER_FM6126A=y
CONFIG_HUB75_LAYOUT_ROWS=1
CONFIG_HUB75_LAYOUT_COLS=1
CONFIG_HUB75_LAYOUT_HORIZONTAL=y
# The driver always runs in the panel's native orientation; p64 rotates in its own
# display layer (a runtime setting, default 90 for the printed shell).
CONFIG_HUB75_ROTATE_0=y

# --- HUB75 quality: 10 bit planes, gamma 2.2, 20 MHz, minimum refresh 250 Hz -> transition
# bit 4, 271.3 Hz, 1024 codes (Quality mode). Photo mode raises the minimum refresh at
# runtime (600 -> transition bit 6, 698 Hz). GDMA priority 5 keeps the panel ahead of the
# crypto engines' DMA bursts. ---
CONFIG_HUB75_BIT_DEPTH_10=y
CONFIG_HUB75_GAMMA_2_2=y
CONFIG_HUB75_CLK_20MHZ=y
CONFIG_HUB75_MIN_REFRESH_RATE=250
CONFIG_HUB75_GDMA_PRIORITY=5
CONFIG_HUB75_LATCH_BLANKING=1
CONFIG_HUB75_BRIGHTNESS=255
CONFIG_HUB75_DOUBLE_BUFFER=y
CONFIG_HUB75_IRAM_OPTIMIZATION=y

# --- microSD card (FAT): long file names, UTF-8 names, larger stdio buffers ---
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=4096

# Diagnostics (review of 2026-09-22, docs/review-2026-09/): per-task run time in
# GET /api/v1/diag/memory (costs nothing measurable; tools/cpu_sample.py reads it).
# Heap attribution by task (heap_by_task in the same document) costs about 4 KB of
# internal RAM, so it stays off: set CONFIG_HEAP_TASK_TRACKING=y in a diagnosis build.
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_COUNTER_TYPE_U64=y

# Internal RAM (review of 2026-09-22, measured: 13 KB free / 11.7 KB largest block became
# 54-58 KB / 32.7 KB with these five lines, pacing unchanged). Allocations above 1 KB go
# to PSRAM first (the esp-mqtt and esp_http_client 4 KB buffers, small artworks and
# canvases, the PEMs; network buffers in PSRAM cost nothing measurable), and the Wi-Fi
# driver's hot code, the FreeRTOS kernel and the ring buffer live in flash instead of the
# SRAM the heap shares with them (26 KB). The card path is unaffected: it uses POSIX
# reads and writes with an explicit internal bounce buffer (M4).
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y

# The esp-mqtt task on core 0 like every other network task (architecture section 2;
# it was unpinned until the review of 2026-09-22).
CONFIG_MQTT_TASK_CORE_SELECTION_ENABLED=y
CONFIG_MQTT_USE_CORE_0=y
